다양한 SQL 연산이 pandas를 이용해 어떻게 실행될 수 있는지에 대해 알아보자.

먼저 pandas와 NumPy를 임포트 한다.

In [1]:
import pandas as pd

In [2]:
import numpy as np

tips 데이터셋을 이용할 거다. tips라는 이름의 DataFrame으로 읽어 들인다.

동일한 구조와 이름의 데이터베이스 테이블에 존재하는 것으로 가정한다.

In [3]:
tips = pd.read_csv("https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv")

In [4]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# 복사 vs 원본변경 연산(Copies vs place operations)

대부분의 pandas  연산은 Series/DataFrame 복사본을 반환한다.

변경 내용을 원본에 반영하기 위해서는 새로운 변수에 할당하거나

    sorted_df = df.sort_values('col1')

또는 원본 파일에 덮어쓴다.
    df = df.sort_values('col1')

Note : 일부 메서드들은 inplace=True 키워드 인자를 제공한다.

df.sort_values('col1', inplace=True) 이런 방법은 권장되지 않는다.

[더 많은 정보](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-view-versus-copy)

# SELECT

SQL에서 selection은 쉼표로 구분되는 칼럼 리스트를 이용한다. (모든 칼럼을 선택하기 위해서는 *를 사용할 수 있다.)

    SELECT total_bill, tip, smoker, time

    FROM tips;

pandas에서는 칼럼 선택을 DataFrame에 칼럼 리스트를 전달함으로써 수행할 수 있다.

In [5]:
tips[['total_bill', 'tip', 'smoker', 'time']]

     total_bill   tip smoker    time
0         16.99  1.01     No  Dinner
1         10.34  1.66     No  Dinner
2         21.01  3.50     No  Dinner
3         23.68  3.31     No  Dinner
4         24.59  3.61     No  Dinner
..          ...   ...    ...     ...
239       29.03  5.92     No  Dinner
240       27.18  2.00    Yes  Dinner
241       22.67  2.00    Yes  Dinner
242       17.82  1.75     No  Dinner
243       18.78  3.00     No  Dinner

[244 rows x 4 columns]

In [6]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

SQL에서 계산된 칼럼을 추가할 수 있다.

    SELECT *, tipe/total_bill as tip_rate

    FROM tips

In [7]:
df = tips

In [8]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

위에처럼 해도 되고,

pandas에서, DataFrame의 assing() 메소드를 이용해 새로운 칼럼을 사용할 수 있다.

# Where

SQL에서 필터링은 where절을 통해 수행된다.

    SELECT *
    FROM tips
    WHERE time = 'Dinner'

In [9]:
is_diner = tips['time'] == 'Dinner'
tips[is_diner]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[176 rows x 7 columns]

In [10]:
is_diner

0      True
1      True
2      True
3      True
4      True
       ...
239    True
240    True
241    True
242    True
243    True
Name: time, Length: 244, dtype: bool

In [11]:
is_diner.value_counts()

True     176
False     68
Name: time, dtype: int64

SQL의 OR와 AND처럼, |(OR) 와 &(AND)를 이용해 여러 조건들을 DataFrame에 전달할 수 있다.

저녁식사로 (time = 'Dinner') 5달러 이상의 tip을 지출한 정보를 인출하기 위해서는 :

    SELECT *
    FROM tips
    WHERE time = 'Dinner' AND tip > 5.00;

In [12]:
filt = (tips['time'] == 'Dinner') & (tips['tip'] > 5.00)
tips[filt]

     total_bill    tip     sex smoker  day    time  size
23        39.42   7.58    Male     No  Sat  Dinner     4
44        30.40   5.60    Male     No  Sun  Dinner     4
47        32.40   6.00    Male     No  Sun  Dinner     4
52        34.81   5.20  Female     No  Sun  Dinner     4
59        48.27   6.73    Male     No  Sat  Dinner     4
116       29.93   5.07    Male     No  Sun  Dinner     4
155       29.85   5.14  Female     No  Sun  Dinner     5
170       50.81  10.00    Male    Yes  Sat  Dinner     3
172        7.25   5.15    Male    Yes  Sun  Dinner     2
181       23.33   5.65    Male    Yes  Sun  Dinner     2
183       23.17   6.50    Male    Yes  Sun  Dinner     4
211       25.89   5.16    Male    Yes  Sat  Dinner     4
212       48.33   9.00    Male     No  Sat  Dinner     4
214       28.17   6.50  Female    Yes  Sat  Dinner     3
239       29.03   5.92    Male     No  Sat  Dinner     3

In [13]:
tips.loc[filt][['tip','total_bill']]

       tip  total_bill
23    7.58       39.42
44    5.60       30.40
47    6.00       32.40
52    5.20       34.81
59    6.73       48.27
116   5.07       29.93
155   5.14       29.85
170  10.00       50.81
172   5.15        7.25
181   5.65       23.33
183   6.50       23.17
211   5.16       25.89
212   9.00       48.33
214   6.50       28.17
239   5.92       29.03

5명 이상이 식사를 했거나, 또는 총 식사 비용이 45달러를 초과하는 레코드들을 인출하라.
    
    SELECT *
    FROM tips
    WHERE size >= 5 OR total_bill > 45
    
이를 DataFrame에 적용하시오

In [14]:
filt = (tips['size'] >= 5) | (tips['total_bill'] > 45)
tips[filt]

     total_bill    tip     sex smoker   day    time  size
59        48.27   6.73    Male     No   Sat  Dinner     4
125       29.80   4.20  Female     No  Thur   Lunch     6
141       34.30   6.70    Male     No  Thur   Lunch     6
142       41.19   5.00    Male     No  Thur   Lunch     5
143       27.05   5.00  Female     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
156       48.17   5.00    Male     No   Sun  Dinner     6
170       50.81  10.00    Male    Yes   Sat  Dinner     3
182       45.35   3.50    Male    Yes   Sun  Dinner     3
185       20.69   5.00    Male     No   Sun  Dinner     5
187       30.46   2.00    Male    Yes   Sun  Dinner     5
212       48.33   9.00    Male     No   Sat  Dinner     4
216       28.15   3.00    Male    Yes   Sat  Dinner     5

In [15]:
frame = pd.DataFrame({
    'col1' : ['A','B', np.nan, 'C', 'D'],
    'col2' : ['F', np.nan, 'G', 'H', 'I']
})

frame

  col1 col2
0    A    F
1    B  NaN
2  NaN    G
3    C    H
4    D    I

    SELECT *
    FROM frame
    WHERE col2 is NULL

DataFrame에서 NULL 검사는 isna(), notna()가 있다.

In [16]:
frame['col2'].isna()

0    False
1     True
2    False
3    False
4    False
Name: col2, dtype: bool

In [17]:
filt = frame['col2'].isna()
frame[filt]

  col1 col2
1    B  NaN

frame 에서 col1의 값이 null이 아닌 행동을 인출하시오.

In [18]:
filt = frame['col1'].isna() == False
frame[filt]

  col1 col2
0    A    F
1    B  NaN
3    C    H
4    D    I

GROUP BY

In [19]:
tips['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [20]:
tips.groupby('sex').size()

sex
Female     87
Male      157
dtype: int64

pandas에서 count()를 사용하지 않고 size()를 사용했음을 주시해라.

이는 count()는 각 칼럼에 적용되어서 not null 값의 수를 반환하기 때문이다.

In [21]:
tips.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157

In [22]:
tips.groupby('sex')

In [23]:
tips.groupby('sex')['total_bill'].count()

sex
Female     87
Male      157
Name: total_bill, dtype: int64

    SELECT day, AVG(tip), count(*)
    FROM tips
    GROUP BY day

In [24]:
tips.groupby('day').agg({'tip' : np.mean, 'day' : np.size})

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

    SELECT smoker, day, count(*), avg(tip)
    FROM tips
    GROUP BY smoker, day;

In [25]:
tips.groupby(['smoker','day']).agg({'tip' : [np.size, np.mean]})

             tip
            size      mean
smoker day
No     Fri     4  2.812500
       Sat    45  3.102889
       Sun    57  3.167895
       Thur   45  2.673778
Yes    Fri    15  2.714000
       Sat    42  2.875476
       Sun    19  3.516842
       Thur   17  3.030000

# JOIN

JOIN은 pandas의 merge() 메서드로 수행된다. 디폴트로 조인은 DataFrame의 인덱스를 기반으로 조인한다.

merge() 메서드는 조인 타입(LEFT, RIGHT, INNER, FULL)을 명시할 수 있고, 

조인의 사용될 칼럼들을 명시 할 수 있다.

In [26]:
df1 = pd.DataFrame({'key' : ['A','B','C','D'], 'value' : np.random.randn(4)})
df1

  key     value
0   A  0.435348
1   B -1.043352
2   C -1.515683
3   D -0.545946

In [27]:
df2 = pd.DataFrame({'key' : ['B','D','D','E'], 'value' : np.random.randn(4)})
df2

  key     value
0   B  1.553478
1   D  0.484620
2   D  1.284315
3   E  1.340843

위의 DataFrame과 동일한 이름과 구조를 가지는 DB 테이블이 있다고 가정하자.

다양한 타입의 JOIN을 실습해 보자.

# INNER JOIN

    SELECT *
    FROM df1 INNER JOIN df2 ON df1.key = df2.key

In [28]:
# merge는 기본적으로 INNER JOIN을 수행한다.
pd.merge(df1, df2, on='key')

  key   value_x   value_y
0   B -1.043352  1.553478
1   D -0.545946  0.484620
2   D -0.545946  1.284315

In [29]:
df1

  key     value
0   A  0.435348
1   B -1.043352
2   C -1.515683
3   D -0.545946

In [30]:
df2

  key     value
0   B  1.553478
1   D  0.484620
2   D  1.284315
3   E  1.340843

In [31]:
df2.set_index('key')

        value
key
B    1.553478
D    0.484620
D    1.284315
E    1.340843

In [32]:
indexed_df2 = df2.set_index('key')

In [33]:
indexed_df2

        value
key
B    1.553478
D    0.484620
D    1.284315
E    1.340843

df1, df2를 inner join => pd.merge(df1, df2, on='key')

df1, indexed_df2를 inner join

In [34]:
pd.merge(df1, df2, on='key')

  key   value_x   value_y
0   B -1.043352  1.553478
1   D -0.545946  0.484620
2   D -0.545946  1.284315

    SELECT *
    FROM df1 INNER JOIN df2 on df1.key = df2.value

In [35]:
indexed_df2

        value
key
B    1.553478
D    0.484620
D    1.284315
E    1.340843

In [36]:
pd.merge(df1, indexed_df2, left_on='key', right_index=True)

  key   value_x   value_y
1   B -1.043352  1.553478
3   D -0.545946  0.484620
3   D -0.545946  1.284315

In [37]:
pd.merge(df1, indexed_df2, left_on='key', right_on='key')

  key   value_x   value_y
0   B -1.043352  1.553478
1   D -0.545946  0.484620
2   D -0.545946  1.284315

# LEFT OUTER JOIN

df1을 df2와 key 칼럼을 기준으로 join을 하되 조인 여부에 관계없이 df1의 모든 레코드는 보여라.

    SELECT *
    FROM df1 LEFT OUTER JOIN df2 on df1.key = df2.key

In [38]:
pd.merge(df1, df2, on='key', how='left')

  key   value_x   value_y
0   A  0.435348       NaN
1   B -1.043352  1.553478
2   C -1.515683       NaN
3   D -0.545946  0.484620
4   D -0.545946  1.284315

    SELECT *
    FROM df1 RIGHT OUTER JOIN df2 on df1.key = df2.key

In [39]:
pd.merge(df1, df2, on='key', how='right')

  key   value_x   value_y
0   B -1.043352  1.553478
1   D -0.545946  0.484620
2   D -0.545946  1.284315
3   E       NaN  1.340843

In [40]:
pd.merge(df1, df2, on='key', how='outer')

  key   value_x   value_y
0   A  0.435348       NaN
1   B -1.043352  1.553478
2   C -1.515683       NaN
3   D -0.545946  0.484620
4   D -0.545946  1.284315
5   E       NaN  1.340843

# UNION

UNION ALL 은 concat()을 이용해 수행될 수 있다.

Concatenation

In [41]:
range(1,4)

range(1, 4)

In [42]:
for x in range(1,4) :
    print(x)

1
2
3

In [43]:
df1 = pd.DataFrame({'city' : ['Seoul', 'Busan', 'Deagu'], 'rank' : range(1,4)})

In [44]:
df1

    city  rank
0  Seoul     1
1  Busan     2
2  Deagu     3

In [45]:

df2 = pd.DataFrame({'city' : ['Seoul','Incheon', 'Gwangju'], 'rank' : [1,4,5]})

In [46]:
df2

      city  rank
0    Seoul     1
1  Incheon     4
2  Gwangju     5

    SELECT city, rank
    FROM df1

    UNION ALL

    SELECT city, rank
    FROM df2

In [47]:
pd.concat([df1,df2])

      city  rank
0    Seoul     1
1    Busan     2
2    Deagu     3
0    Seoul     1
1  Incheon     4
2  Gwangju     5

In [48]:
pd.concat([df1,df2]).drop_duplicates()

      city  rank
0    Seoul     1
1    Busan     2
2    Deagu     3
1  Incheon     4
2  Gwangju     5

# LIMIT

    SELECT *
    FROM tips
    ORDER BY id desc
    LIMIT 10;

In [49]:
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [50]:
tips.sort_values(by='total_bill', ascending=False).head(10)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
156       48.17   5.00    Male     No   Sun  Dinner     6
182       45.35   3.50    Male    Yes   Sun  Dinner     3
102       44.30   2.50  Female    Yes   Sat  Dinner     3
197       43.11   5.00  Female    Yes  Thur   Lunch     4
142       41.19   5.00    Male     No  Thur   Lunch     5
184       40.55   3.00    Male    Yes   Sun  Dinner     2
95        40.17   4.73    Male    Yes   Fri  Dinner     4

# UPDATE

tips 테이블에서 tip 값이 2미만인 행들을 찾아서 그 tip 값을 두 배로 변경하라.

    UPDATE tips
    SET tip = tip * 2
    WHERE tip < 2

In [56]:
filt = tips['tip'] < 2

In [57]:
tips[filt]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
8         15.04  1.96    Male     No   Sun  Dinner     2
10        10.27  1.71    Male     No   Sun  Dinner     2
12        15.42  1.57    Male     No   Sun  Dinner     2
16        10.33  1.67  Female     No   Sun  Dinner     3
30         9.55  1.45    Male     No   Sat  Dinner     2
43         9.68  1.32    Male     No   Sun  Dinner     2
53         9.94  1.56    Male     No   Sun  Dinner     2
57        26.41  1.50  Female     No   Sat  Dinner     2
58        11.24  1.76    Male    Yes   Sat  Dinner     2
62        11.02  1.98    Male    Yes   Sat  Dinner     2
67         3.07  1.00  Female    Yes   Sat  Dinner     1
70        12.02  1.97    Male     No   Sat  Dinner     2
75        10.51  1.25    Male     No   Sat  Dinner     2
82        10.07  1.83  Female     No  Thur   Lunch     1
92         5.75  1.00  Female    Yes   Fri  Dinner     2
97        12.03  1.50    Male    Yes   Fri  Dinner     2
99        12.46  1.50    Male     No   Fri  Dinner     2
105       15.36  1.64    Male    Yes   Sat  Dinner     2
111        7.25  1.00  Female     No   Sat  Dinner     1
117       10.65  1.50  Female     No  Thur   Lunch     2
118       12.43  1.80  Female     No  Thur   Lunch     2
121       13.42  1.68  Female     No  Thur   Lunch     2
126        8.52  1.48    Male     No  Thur   Lunch     2
130       19.08  1.50    Male     No  Thur   Lunch     2
132       11.17  1.50  Female     No  Thur   Lunch     2
135        8.51  1.25  Female     No  Thur   Lunch     2
145        8.35  1.50  Female     No  Thur   Lunch     2
146       18.64  1.36  Female     No  Thur   Lunch     3
147       11.87  1.63  Female     No  Thur   Lunch     2
148        9.78  1.73    Male     No  Thur   Lunch     2
168       10.59  1.61  Female    Yes   Sat  Dinner     2
190       15.69  1.50    Male    Yes   Sun  Dinner     2
195        7.56  1.44    Male     No  Thur   Lunch     2
215       12.90  1.10  Female    Yes   Sat  Dinner     2
217       11.59  1.50    Male    Yes   Sat  Dinner     2
218        7.74  1.44    Male    Yes   Sat  Dinner     2
222        8.58  1.92    Male    Yes   Fri   Lunch     1
224       13.42  1.58    Male    Yes   Fri   Lunch     2
233       10.77  1.47    Male     No   Sat  Dinner     2
235       10.07  1.25    Male     No   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2

In [59]:
tips[filt]['tip']

0      1.01
1      1.66
8      1.96
10     1.71
12     1.57
16     1.67
30     1.45
43     1.32
53     1.56
57     1.50
58     1.76
62     1.98
67     1.00
70     1.97
75     1.25
82     1.83
92     1.00
97     1.50
99     1.50
105    1.64
111    1.00
117    1.50
118    1.80
121    1.68
126    1.48
130    1.50
132    1.50
135    1.25
145    1.50
146    1.36
147    1.63
148    1.73
168    1.61
190    1.50
195    1.44
215    1.10
217    1.50
218    1.44
222    1.92
224    1.58
233    1.47
235    1.25
236    1.00
237    1.17
242    1.75
Name: tip, dtype: float64

In [62]:
tips[filt]['tip'].count()

45

In [65]:
tips[filt]['tip']

0      1.01
1      1.66
8      1.96
10     1.71
12     1.57
16     1.67
30     1.45
43     1.32
53     1.56
57     1.50
58     1.76
62     1.98
67     1.00
70     1.97
75     1.25
82     1.83
92     1.00
97     1.50
99     1.50
105    1.64
111    1.00
117    1.50
118    1.80
121    1.68
126    1.48
130    1.50
132    1.50
135    1.25
145    1.50
146    1.36
147    1.63
148    1.73
168    1.61
190    1.50
195    1.44
215    1.10
217    1.50
218    1.44
222    1.92
224    1.58
233    1.47
235    1.25
236    1.00
237    1.17
242    1.75
Name: tip, dtype: float64

In [66]:
tips[filt].tip

0      1.01
1      1.66
8      1.96
10     1.71
12     1.57
16     1.67
30     1.45
43     1.32
53     1.56
57     1.50
58     1.76
62     1.98
67     1.00
70     1.97
75     1.25
82     1.83
92     1.00
97     1.50
99     1.50
105    1.64
111    1.00
117    1.50
118    1.80
121    1.68
126    1.48
130    1.50
132    1.50
135    1.25
145    1.50
146    1.36
147    1.63
148    1.73
168    1.61
190    1.50
195    1.44
215    1.10
217    1.50
218    1.44
222    1.92
224    1.58
233    1.47
235    1.25
236    1.00
237    1.17
242    1.75
Name: tip, dtype: float64

In [67]:
tips.loc[filt, 'tip']

0      1.01
1      1.66
8      1.96
10     1.71
12     1.57
16     1.67
30     1.45
43     1.32
53     1.56
57     1.50
58     1.76
62     1.98
67     1.00
70     1.97
75     1.25
82     1.83
92     1.00
97     1.50
99     1.50
105    1.64
111    1.00
117    1.50
118    1.80
121    1.68
126    1.48
130    1.50
132    1.50
135    1.25
145    1.50
146    1.36
147    1.63
148    1.73
168    1.61
190    1.50
195    1.44
215    1.10
217    1.50
218    1.44
222    1.92
224    1.58
233    1.47
235    1.25
236    1.00
237    1.17
242    1.75
Name: tip, dtype: float64

In [68]:
tips.loc[filt,'tip'] = tips.loc[filt, 'tip'] * 2

In [69]:
tips.loc[filt,'tip']

0      2.02
1      3.32
8      3.92
10     3.42
12     3.14
16     3.34
30     2.90
43     2.64
53     3.12
57     3.00
58     3.52
62     3.96
67     2.00
70     3.94
75     2.50
82     3.66
92     2.00
97     3.00
99     3.00
105    3.28
111    2.00
117    3.00
118    3.60
121    3.36
126    2.96
130    3.00
132    3.00
135    2.50
145    3.00
146    2.72
147    3.26
148    3.46
168    3.22
190    3.00
195    2.88
215    2.20
217    3.00
218    2.88
222    3.84
224    3.16
233    2.94
235    2.50
236    2.00
237    2.34
242    3.50
Name: tip, dtype: float64

tip이 9보다 큰 행들을 찾아 출력하시오

    SELECT * FROM tips WHERE tips > 9;

In [71]:
filt = tips['tip'] > 9

In [72]:
tips[filt]

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3

In [73]:
tips[filt].index

Int64Index([170], dtype='int64')

In [74]:
tips.drop(index = tips[filt].index)

     total_bill   tip     sex smoker   day    time  size
0         16.99  2.02  Female     No   Sun  Dinner     2
1         10.34  3.32    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  3.50    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[243 rows x 7 columns]

아까처럼 드랍을 해도 되고, 아니면 9 이하의 값들만을 다시 저장하는 방법도 있다.